app/controllers/api/v1/deposits_controller.rb

  def show
    respond_with Deposit.find(params[:id])
---
SELECT  "deposits".* FROM "deposits" WHERE "deposits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    if current_user.role == "admin"
      @deposits = Deposit.all.order(created_at: :desc)
    else
      @deposits = current_user.deposits.order(created_at: :desc)
    end

    bank_name = filter_params[:bank_name]
    min_amount = filter_params[:min_amount]
    max_amount = filter_params[:max_amount]
    from_date = filter_params[:from_date]
    to_date = filter_params[:to_date]

    if bank_name.present?
      @deposits = @deposits.where("bank_name ILIKE ?", "%#{bank_name}%")
---
SELECT "deposits".* FROM "deposits" WHERE "deposits"."user_id" = $1 AND (bank_name ILIKE '%a%') AND (initial_amount <= '909090') AND (end_date <= '18-09-28') ORDER BY "deposits"."created_at" DESC  [["user_id", 22]]
SELECT "deposits".* FROM "deposits" WHERE "deposits"."user_id" = $1 AND (start_date >= '2017-10-02') AND (end_date <= '2017-10-27')  [["user_id", 20]]

  def create
    deposit = @selected_user.deposits.build(deposit_params)
    if deposit.save
---
INSERT INTO "deposits" ("bank_name", "account_number", "initial_amount", "start_date", "end_date", "interest_percentage", "taxes_percentage", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    if @deposit.update(deposit_params)
---
UPDATE "deposits" SET "initial_amount" = $1, "start_date" = $2, "interest_percentage" = $3, "updated_at" = $4 WHERE "deposits"."id" = $5  [["initial_amount", "10.0"], ["start_date", nil], ["interest_percentage", "2.0"], ["updated_at", "2017-10-07 01:43:32.981196"], ["id", 1]]

  def destroy
    @deposit.destroy
---
DELETE FROM "deposits" WHERE "deposits"."id" = $1  [["id", 1]]

    def set_deposit
      @deposit = @selected_user.deposits.find_by(id: params[:id])
      if !@deposit.present?
---
SELECT  "deposits".* FROM "deposits" WHERE "deposits"."user_id" = $1 AND "deposits"."id" = $2 LIMIT $3  [["user_id", 12], ["id", 2], ["LIMIT", 1]]
SELECT "deposits".* FROM "deposits"