app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "kyle@depmanager.com"], ["LIMIT", 1]]
UPDATE "users" SET "current_sign_in_at" = $1, "last_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["current_sign_in_at", "2017-10-06 11:12:59.097928"], ["last_sign_in_at", "2017-10-06 11:08:51.714942"], ["sign_in_count", 3], ["updated_at", "2017-10-06 11:12:59.098651"], ["id", 5]]
---
	def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = user_email.present? && User.find_by(email: user_email)

    if user.present? and user.valid_password? user_password
      sign_in user, store: false
      user.generate_authentication_token!
      user.save

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "naarUL939Cv1y426Fdza"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."auth_token" = $1 AND ("users"."id" != $2) LIMIT $3  [["auth_token", "RqdyoEHxAxcfDb-y7MgS"], ["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", "RqdyoEHxAxcfDb-y7MgS"], ["updated_at", "2017-10-06 11:25:38.800273"], ["id", 5]]
---
  def destroy
    user = User.find_by(auth_token: params[:id])
    if user.present?
      user.generate_authentication_token!
      user.save