app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
	def index
		respond_with User.all.order(created_at: :desc)

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "auth_token", "role") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
    if user_signed_in?
    	if current_user.role == 'regular'
    		render json: { errors: "You don't have a permission to create a user" }, status: 403
    		return
    	end
    end

    user = User.new(user_params)
    if user.save

UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "chuck@depmanager.com"], ["encrypted_password", "$2a$11$r6rLU7a4MEYs9WYU2AbhteonQsPZsefQHZtnAv/3XDAlE7hjEd4ji"], ["updated_at", "2017-10-06 11:55:28.979145"], ["id", 9]]
---
  def update
	  if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  	def set_user
  		@user = User.find_by(id: params[:id])
  		if !@user.present?